#include "driver_pit.h"
#include "isr.h"
//-------------------------------------------------------------------------------------------------------------------
//  函数简介      获取pit中断标识位
//  参数说明      base           选择EPIT_Type模块
//  返回参数      void
//  备注信息
//-------------------------------------------------------------------------------------------------------------------
uint8 pit_flag_get(EPIT_Type* base)
{
	return base->SR & (1 << 0);
}
//-------------------------------------------------------------------------------------------------------------------
//  函数简介      清楚pit中断标识位
//  参数说明      base           选择EPIT_Type模块
//  返回参数      void
//  备注信息
//-------------------------------------------------------------------------------------------------------------------
void pit_flag_clear(EPIT_Type* base)
{
	base->SR |= 1 << 0;
}
//-------------------------------------------------------------------------------------------------------------------
//  函数简介      pit关闭
//  参数说明      base           选择EPIT_Type模块
//  返回参数      void
//  使用示例      pit_close(EPIT1); // 关闭CCU60 通道0的计时器
//  备注信息
//-------------------------------------------------------------------------------------------------------------------
void pit_close(EPIT_Type* base)
{
	base->CR &= ~(1 << 0);	/* 关闭定时器 */
}
//-------------------------------------------------------------------------------------------------------------------
//  函数简介      pit重启
//  参数说明      base           选择EPIT_Type模块
//  返回参数      void
//  使用示例      epit_close(EPIT1); // 关闭CCU60 通道0的计时器
//  备注信息
//-------------------------------------------------------------------------------------------------------------------
void pit_restart(EPIT_Type* base)
{
	base->CR &= ~(1 << 0);	/* 先关闭定时器 */
	base->LR = base->CNR;		/* 计数值 			*/
	base->CR |= (1 << 0);	/* 打开定时器 		*/
}
//-------------------------------------------------------------------------------------------------------------------
//  函数简介      pit初始化
//  参数说明      base           选择EPIT_Type模块
//  参数说明      time                周期时间
//  返回参数      void
//  使用示例      pit_init(EPIT1, 5000);      // 设置周期中断5000us
//  备注信息      请使用.h文件中 带时间单位的宏定义函数
//-------------------------------------------------------------------------------------------------------------------
void pit_init(EPIT_Type* base, uint32 time)
{
	base->CR = 0;	//先清零
	/*
	 * CR寄存器:
	 * bit [25-24]		01 时钟源选择Peripheral clock=66MHz
	 * bit [15:4]		0  1分频
	 * bit [3]:			1  当计数器到0的话从LR重新加载数值
	 * bit [2]:			1  比较中断使能
	 * bit [1]:			1  初始计数值来源于LR寄存器值
	 * bit [0]:			0  先关闭EPIT1
	 */
	base->CR = (kEPIT_ClockSource_Periph << 24 | 1 << 3 | 1 << 2 | 1 << 1);


	/* 计数值    */
	base->LR =  66 * time;
	/* 比较寄存器，当计数器值和此寄存器值相等的话就会产生中断 */
	base->CMPR = 0;

	
	/* 注册中断服务函数 */
	if (base == EPIT1)
	{
		GIC_EnableIRQ(EPIT1_IRQn);	/* 使能GIC中对应的中断 */
		SystemInstallIrqHandler(EPIT1_IRQn, (system_irq_handler_t)EPIT1_IRQn_Irq_Handler, NULL);
	}
	else if(base == EPIT2)
	{
		GIC_EnableIRQ(EPIT2_IRQn);	/* 使能GIC中对应的中断 */
		SystemInstallIrqHandler(EPIT2_IRQn, (system_irq_handler_t)EPIT2_IRQn_Irq_Handler, NULL);
	}
	base->CR |= (1 << 0);	/* 打开定时器 		*/
}


