#include "common_headfile.h"
#include "buzzer.h"

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     蜂鸣器蜂鸣
// 参数说明     buzzer_time     蜂鸣时间, ms
// 返回参数     void          
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void Buzzer(uint32 buzzer_time)
{
	gpio_set_level(P05_1, 0);
	system_delay_ms(buzzer_time);
	gpio_set_level(P05_1, 1);
}



