#ifndef _COMMON_HEADFILE_H_
#define _COMMON_HEADFILE_H_

//===================================================C语言 函数库===================================================
#include "math.h"
#include "stdio.h"
#include "stdint.h"
#include "string.h"
//===================================================C语言 函数库===================================================

//===================================================库函数公共层===================================================
#include "common_clock.h"
#include "common_front.h"
#include "common_function.h"
#include "common_typedef.h"
//===================================================库函数公共层===================================================

//===================================================芯片外设公共层===================================================
#include "MCIMX6Y2.h"
#include "fsl_gpio.h"
#include "fsl_iomuxc.h"
#include "fsl_common.h"
//===================================================芯片外设公共层===================================================

//===================================================芯片外设驱动层===================================================
#include "driver_delay.h"
#include "driver_exit.h"
#include "driver_gpio.h"
#include "driver_iic.h"
#include "driver_pit.h"
#include "driver_pwm.h"
#include "driver_rtc_clock.h"
#include "driver_spi.h"
#include "driver_uart.h"
//===================================================芯片外设驱动层===================================================

//===================================================外接设备驱动层===================================================
#include "device_ap3216c.h"
#include "device_icm20608.h"
#include "device_key.h"
#include "device_lcd.h"
#include "device_tft_gt9147.h"
#include "device_tft5xx6.h"
//===================================================外接设备驱动层===================================================

//===================================================个人功能函数层===================================================
#include "button.h"
#include "buzzer.h"
#include "led.h"
#include "test_device.h"
//===================================================个人功能函数层===================================================

#endif
